Repository: KAMI911/cinnamon-l10n-hu
Catalog: user-guide-common-installation-*.po
Languages: hu

source: Installation of Linux Mint
hu: A Linux Mint telepítése

source: You can download the Linux Mint operating system for free. It comes as an ISO file which you need to burn to a blank DVD<footnote><para>It is also possible to write the ISO image to a USB stick or other memory device and boot from that, or to boot from the ISO image on the hard drive, but these options are somewhat more advanced and the method presented here is recommended. For help with alternative methods of installing and running Linux Mint, please visit the forums.</para></footnote>. The liveDVD is then bootable and provides a fully-functional operating system which you can try without affecting your PC. In layman's terms, when you put Linux Mint on a DVD and place it into your computer, you can try it out while leaving your current system intact.
hu: Ingyenesen letöltheti a Linux Mint operációs rendszert. A rendszer egy ISO lemezképfájl formában érkezik, amelyeket ki kell írnia egy üres DVD-lemezre<footnote><para>A ISO lemezkép-fájlt kiírhatja egy USB pendrive-ra vagy más memóriával rendelkező eszközre. Indítsa el a rendszert onnan, vagy kezdeményezzen rendszerindítást egy merevlemezen lévő ISO lemezképfájllal. Ezek a lehetőségek haladó felhasználóknak valók, így a most ismertetésre kerülő eljárás az elsődlegesen javasolt megoldás. A telepítés és Linux Mint alternatív futtatásának lehetőségeiről kapcsolatos további információkért látogassa meg fórumainkat.</footnote></para>. A liveDVD segítségével rendszerindítást végezhet. A liveDVD egy minden funkcióval rendelkező operációs rendszert biztosít, amelyet úgy tud kipróbálni, hogy nem változtat meg semmit a számítógépe jelenlegi állapotán. Összefoglalva: Amikor a Linux Mint DVD-ről elindítja az új rendszert, a jelenlegi számítógépének megváltoztatása nélkül próbálhatja ki azt.

source: If you like what you see when running the liveDVD you can decide to install the system to your hard drive. All the necessary tools (partitioning and installation tools) are present on the DVD.
hu: Ha kedvére való, amit lát a liveDVD futtatása közben, akkor dönthet a merevlemezére történő rendszer telepítéséről is. Az összes szükséges eszköz (particionáló és telepítő) elérhető a DVD-n.

source: Download the ISO
hu: ISO lemezképfájl letöltése

source: To download Linux Mint, visit the download page at <ulink url="http://www.linuxmint.com/download.php">http://www.linuxmint.com/download.php</ulink> and choose the edition you're interested in.
hu: A Linux Mint letöltéséhez, látogassa meg a letöltési oldalt, a következő címen: <ulink url="http://www.linuxmint.com/download.php">http://www.linuxmint.com/download.php</ulink> és válassza ki az Ön számára érdekes változatot.

source: From this page, you should find:
hu: Ezen az oldalon a következőket találhatja:

source: an MD5 signature
hu: egy MD5 ellenőrzőösszeg

source: a torrent link
hu: egy torrent hivatkozás

source: a list of download mirrors
hu: egy lista a letöltési tükörszerverekről

source: The file you need to download is an ISO file. There are two ways to download this file, by torrent (a Peer to Peer protocol) or via a download mirror (HTTP or FTP protocol). Once your download is finished, you can ensure your ISO file isn’t corrupted by checking its signature with the MD5.
hu: A fájl, amelyet le kell töltenie ISO lemezképfájl formátumú. Két módon tudja letölteni ezt a fájlt: torrent segítségével (Peer to Peer protokoll) vagy közvetlen letöltéssel (HTTP vagy FTP protokoll). Ha a letöltés véget ért, ellenőrizze az MD5 ellenőrzőösszeg segítségével, hogy az ISO lemezképfájl sértetlenségét.

source: If you don't have a broadband connection, or if your Internet access is too slow you can order the DVD from <ulink url="http://www.osdisc.com">http://www.osdisc.com</ulink>.
hu: Ha nem rendelkezik széles sávú internet-kapcsolattal, vagy túl lassú az internet-kapcsolata, megrendelheti a DVD a <ulink url="http://www.osdisc.com">http://www.osdisc.com</ulink> oldalon keresztül.

source: Via torrent
hu: Torrent segítségével

source: Torrent is a Peer to Peer (P2P) protocol. Basically, instead of downloading from a central location, a torrent lets you download the ISO file in parts from different people across the Internet.
hu: A torrent egy Peer to Peer (P2P) protokoll. Ahelyett, hogy egy központi helyről töltené le a telepítőt, a torrentek segítségével az ISO lemezképfájl különböző emberektől kerül az interneten keresztül letöltésre.

source: The more people who download the ISO file, the faster the download speed gets. This is the preferred and recommended way to download Linux Mint.
hu: Minél több embert tölti le egy időben az ISO lemezképfájlt, annál nagyobb lesz a letöltés sebessége. Ez az előnyben részesített és az ajánlott módja a Linux Mint letöltésének.

source: Install a Torrent client
hu: Torrent kliens telepítése

source: You need a piece of software called a "torrent client" in order to download files via torrent.
hu: Szüksége lesz egy „torrent kliens” programra, hogy torrent segítségével letölthesse a kért fájlt.

source: If you run Linux Mint you already have a torrent client installed.
hu: Amennyiben Linux Mintet használ, akkor már van torrent kliens a számítógépre telepítve.

source: If you run another Linux distribution, you can install "Transmission".
hu: Ha másik Linux disztribúciót használ, telepítse a „Transmission” nevű kliensprogramot.

source: If you run Windows you can use µTorrent.
hu: Ha Windowst használ, használja a „µTorrent” kliensprogramot.

source: Download the Torrent file
hu: A torrent fájl letöltése

source: The next step is to follow the torrent link from the Linux Mint website and to download the .torrent file. This file is very small. After it downloads, you should open it with your torrent client.
hu: A következő lépésben a Linux Mint weboldaláról töltse le a „.torrent” kiterjesztésű torrent fájlt. Ez a fájl nagyon kicsi. A letöltés után egy torrent klienssel kell megnyitnia fájlt.

source: The torrent client will probably ask you where you want to save the ISO. Select a destination and then wait for the download to complete.
hu: A torrent kliens lehet megkérdezi, hogy hova mentse el az ISO lemezképet. Válassza ki a célmappát és a várja meg a letöltés befejeződését.

source: For more information about the torrent protocol, visit <ulink url="http://en.wikipedia.org/wiki/BitTorrent">http://en.wikipedia.org/wiki/BitTorrent</ulink>.
hu: A torrent protokollról további tudnivalók: <ulink url="http://en.wikipedia.org/wiki/BitTorrent">http://en.wikipedia.org/wiki/BitTorrent</ulink>.

source: Via direct download
hu: Közvetlen letöltéssel

source: If you can’t, or do not choose to use the torrent protocol, then look at the list of download mirrors and pick one of them. They’ll provide a link to the ISO file itself which you can just click to start the download.
hu: Ha nem választhatja, vagy nem szeretné használni a torrent protokollt, akkor nézze meg a letöltési helyek listáját és válasszon onnan egyet. Itt az ISO lemezképfájlra mutató letöltési hivatkozásokat talál, amelyre kattintva elindíthatja a letöltést.

source: Read the release notes
hu: Olvassa el a kiadási megjegyzéseket

source: Your download is probably going to last at least an hour, so now would be the perfect time for you to get familiar with the new features coming with the release you’re currently downloading.
hu: A letöltés akár egy órán keresztül is eltarthat, így az azt javasoljuk, használja fel ezt az időt arra, hogy megismerje az új funkciókat amely az éppen letöltődő kiadással érkeznek.

source: The release notes are featured on the Linux Mint web page and answer the following questions:
hu: A kiadási megjegyzéseket a Linux Mint weboldalán találja és a következő témákat érinti:

source: What are the new features delivered in this release?
hu: Milyen fejlesztések érkeztek ezzel a verzióval?

source: What are the known problems of this release?
hu: Milyen ismert problémák vannak ezzel a verzióval?

source: How do I upgrade from the previous release?
hu: Hogyan frissíthetek az előző verzióról?

source: They also contain screenshots of the latest release. Of course, you could find out about most features highlighted in the release notes by simply using the operating system, but you might miss a few things, so it is most reliable to read the release notes.
hu: Továbbá képernyőképeket tartalmaz a legújabb kiadásról. Természetesen a legtöbb kiadási megjegyzésben kiemelt szolgáltatását felfedezheti az operációs rendszer használatával, de néhány elkerülheti a figyelmét. Ezért javasoljuk a kiadási megjegyzések tanulmányozását.

source: The release notes for Linux Mint 17 Qiana are available at <ulink url="http://www.linuxmint.com/rel_qiana.php">http://www.linuxmint.com/rel_qiana.php</ulink>
hu: A Linux Mint 17 Qiana verziójára vonatkozó kiadási megjegyzéseket itt találja: <ulink url="http://www.linuxmint.com/rel_qiana.php">http://www.linuxmint.com/rel_qiana.php</ulink>

source: Check the MD5
hu: MD5 ellenőrzőösszeg ellenőrzése

source: You’ve read the release notes, you just can’t wait to play with the new features or try Linux Mint, and your download just finished successfully. You’re ready to burn a DVD and to boot on it… but hey! Wait for a second!
hu: Elolvasta a kiadási megjegyzéseket, a telepítőkészlet is letöltődött, és már nagyon várja, hogy kipróbálja a Linux Mint új szolgáltatásait. Készen áll arra, hogy kiírja a lemezképet egy DVD-re és elindítsa a rendszert arról. De várjon egy picit!

source: If that DVD is faulty you will experience weird bugs and will have a lot of trouble finding help. The two most common reasons for a DVD to be faulty are:
hu: Ha a DVD hibás, akkor nagyon furcsa hibákat fog tapasztalni, és rengeteg problémához kell majd segítséget találnia. A két leggyakoribb oka a hibás DVD-nek:

source: An issue with the download causing problems in your ISO file
hu: Letöltési probláma miatt hibás lesz az ISO lemezkép

source: An error during the burn process that alters the contents of your burned liveDVD
hu: Hiba lép fel a ISO lemezkép DVD-re történő írása során, így megváltozik a kiírt liveDVD tartalma

source: The MD5 signature, which is present on the download page, provides a quick way for you to make sure that your ISO file is exactly like it should be. So, let’s check the ISO file you just downloaded before we burn it and save ourselves from a lot of potential problems.
hu: A letöltési oldalról elérhető MD5 ellenőrzőösszeg a leggyorsabb módja annak, hogy megbizonyosodjon az ISO lemezképfájl sértetlenségéről. Kiírás előtt ellenőrizze az imént letöltött ISO lemezképfájlt, így sok kellemetlenségtől óvhatja meg magát.

source: If you run any version of Linux you probably already have the md5sum program installed. Open a terminal and “cd” to the directory where your ISO file is (for instance, if “linuxmint.iso” is on the Desktop), open a terminal and type:
hu: Bármilyen Linuxot is használ vélhetően telepítve van gépére a „md5sum” program. Nyissa meg a terminált és váltson át a ISO lemezképfájlt tartalmazó mappára (például ha a képfájl „linuxmint.iso” néven található az Asztalon) és írja be az következő parancsot:

source: This command should output a series of numbers and letters which comprise the MD5 sum, or signature, of your ISO file. By design, any small change to the ISO file will cause this signature to be significantly different, allowing us to verify that the file is exactly as it should be.
hu: Ez a parancs számok és betűk sorozatát írja ki a képernyőre, amely az MD5 ellenőrzőösszeg vagy az ISO lemezképfájl aláírása. Ez ez ellenőrzőösszeg az ISO lemezképfájl legapróbb megváltozására is alaposan megváltozik, így ellenőrizhetjük, hogy a fájl teljesen olyan, mint amilyennek lennie kellene.

source: Compare that signature with the one on the download page of the Linux Mint website. If the two signatures are the same, then you know your ISO file is exactly the same as the original and you can now get ready to burn it on DVD.
hu: Hasonlítsa össze az aláírás értékét a Linux Mint letöltési oldalán található értékkel. Amennyiben a kért érték megegyezik, akkor a biztos lehet benne, hogy letöltött ISO lemezképfájl azonos az eredetivel és így már kiírhatja azt egy DVD lemezre.

source: If you happen to run Windows, chances are you don’t have md5sum installed. You can get it from here: <ulink url="http://www.etree.org/md5com.html">http://www.etree.org/md5com.html</ulink>
hu: Windows-t futtatva valószínűleg nincs telepítve gépére a „md5sum” program. Innen letöltheti: <ulink url="http://www.etree.org/md5com.html">http://www.etree.org/md5com.html</ulink>

source: Place the ISO file and the md5sum.exe in the same place (let’s say in C:\) and run “cmd.exe”. In the command line environment, type the following commands:
hu: Helyezze az ISO lemezképfájlt és az „md5sum.exe”-t ugyanabba a könyvtárba (például: a „C:\”-be) és futtassa a „cmd.exe” parancsot. A parancssorba gépelje be a következő parancsokat:

source: Then compare the signature to the one present on the website.
hu: Ezután hasonlítsa össze az ellenőrzőösszeget a holnap található ellenőrzőösszeggel.

source: Burn the ISO to DVD
hu: ISO lemezképfájl DVD-re írása

source: Now that you have checked the ISO file with MD5, you are ready to burn it to a DVD.
hu: Most, hogy már ellenőrizte az ISO lemezképfájlt MD5 ellenőrzőösszeggel, kiírhatja egy DVD lemezre.

source: Get a blank DVD-R (a DVD-RW should work as well, but this type of media is known to have compatibility issues) and your favorite marker and label the DVD. Although labeling your DVDs sounds trivial, you should be sure to do so, as you can easily end up with 20 unlabeled and unidentifiable discs on your desk. :)
hu: Szerezzen egy üres DVD-R lemezt (DVD-RW-vel is működnie kell, de az ilyen típusú lemezeknél előfordulhatnak kompatibilitási problémák) és a kedvenc filcével címkézze fel a DVD-t. Bár a DVD címkézése triviálisnak hangzik, mindenképpen hajtsuk végre, mert ha elmarad, könnyen eljuthatunk oda, hogy 20 címkézetlen, azonosíthatatlan lemezünk hever majd az asztalon.

source: Insert the blank DVD-R in the drive and get ready to burn the ISO.
hu: Helyezzen egy üres DVD-R lemezt a meghajtóba és készen áll a ISO lemezképfájl írására.

source: If you’re running Linux with Cinnamon right-click on the ISO file and select: open with: Brasero, choose “Burn image” and follow the steps given there.
hu: Ha Linuxot használ Cinnamon asztallal, akkor kattintson az ISO lemezképfájlra jobb egérgombbal és válassza a „Megnyitás: Brasero” vagy a „Lemezkép kiírása” lehetőséget a helyi menüből, majd kövesse a megadott lépéseket.

source: If you’re running Linux with KDE, launch K3B and in the “Tools” menu choose “Write ISO Image”.
hu: Amennyiben KDE asztallal rendelkező Linuxot futtat, indítsa el a „K3B” programot, és a „Eszközök” menüből válassza az „Írás ISO-képmásból…” menüpontot.

source: If you’re running Windows you can use a program like InfraRecorder.
hu: Ha Windows-t használ akkor használhatja az InfraRecorder programot.

source: Make sure to burn the ISO image to disk, and not to write the ISO file to the disk. A very common mistake, especially for people using Nero, is to actually burn the ISO file on the disk as a data file. The ISO file is an image of a disk so it needs to be burnt not as a file which will appear on the disk, but as an ISO image which will be decompressed and whose content will be burnt onto the disc. After burning the DVD you shouldn't see the ISO file within the disc, but rather folders like “casper” or “isolinux”. Most burning software has a special option for this.
hu: Bizonyosodjon meg róla, hogy a ISO lemezképet a lemezre írta és nem egy ISO lemezképfájlt hozott létre a lemezen. Gyakori hiba, különösen a Nero nevű program használói körében, hogy az ISO lemezképfájlt adatfájlként írja ki a lemezre. Az ISO lemezképfájl egy lemezkép, így nem egy fájlként kell a lemezre írni, ami fájlként látható a lemezen, hanem ISO lemezképként, amely kicsomagolásra kerül és a tartalma lesz a lemezre írva. A DVD lemez írása után nem egy ISO lemezképfájlt láthat a lemezen, hanem olyan mappákat mint „casper” vagy „isolinux” . A legtöbb íróprogram külön lehetőségként biztosítja ezt.

source: Boot the LiveDVD
hu: Rendszerindítás LiveDVD-ről

source: Place the DVD in the drive and restart the computer. You should now see the following screen:
hu: Helyezze a DVD-t a meghajtóba és indítsa újra a számítógépet. A következő képernyőnek kellene megjelennie:

source: The boot screen
hu: A rendszerindítás képernyőképe

source: If you don’t see this screen and your PC boots as usual it’s probably because your BIOS is not set to boot on DVD. Restart the computer and press F1, F2, Delete, or Escape (or whatever key lets you enter the BIOS configuration) and change your BIOS settings to tell your computer to boot from its DVD drive.
hu: Ha nem látja ezt a képernyőképet és a számítógépe a hagyományos módon indul, ez azért lehet, mert a BIOS-ban nincs beállítva DVD-ről történő rendszerindítás. Indítsa újra a számítógépet és nyomja meg az F1, az F2, az F10, az F12, a Delete vagy a Escape gomot – attól függően, hogy melyik gombbal lehet belépni a BIOS konfigurációs menübe – és a DVD-ről történő rendszerindítást állítsa be a BIOS beállításokat között.

source: Install Linux Mint on your hard drive
hu: Linux Mint telepítése a merevlemezre

source: From the first screen choose the default <guilabel>Start Linux Mint</guilabel> option and press Enter. After a little while the live system should be ready and you should see the desktop.
hu: Az első képernyőről válassza ki az alapértelmezett <guilabel>Start Linux Mint</guilabel> lehetőségét majd nyomja meg az Enter gombot. Kis idő múlva elindul a live rendszer és megjelenik az Asztal.

source: At this stage Linux Mint is not installed on your computer, it’s simply running from the DVD. The system you have in front of you is, however, almost exactly the same as the one you will have on your computer after the installation is finished.
hu: Jelenleg a Linux Mint nem települt a számítógépre, hanem a DVD-ről fut. A megjelenő rendszer nagyjából teljesen megegyezik, a telepítés után a számítógépére kerülő operációs rendszerrel.

source: Have fun with it and see if you like it. Bear in mind that when running from the DVD, Linux Mint runs significantly slower than it does when it is installed on a hard drive, since it has to read data from the DVD drive, which is a slower medium than the hard drive.
hu: Próbálja ki, és nézze meg hogy tetszik. Vegye figyelembe hogy a DVD-ről futó Linux Mint jelentősen lassabb a számítógép merevlemezére telepített rendszernél, mert az adatokat a DVD lemeztől olvassa, amely jelentősen lassabb a merevlemeznél.

source: When you are ready, double-click on the <guilabel>Install Linux Mint</guilabel> icon located on the desktop. The Installer appears:
hu: Amikor felkészült, kattintson duplán az asztalon található <guilabel>Install Linux Mint</guilabel> ikonra. Ekkor elindul a telepítő:

source: The language selection screen
hu: Nyelvválasztó képernyőkép

source: If you haven’t read the release notes yet, and you have an Internet connection, then this an ideal opportunity to review them; simply click on the underlined link. It is highly recommended that users read the release notes prior to installation in order to advise themselves of new features, as well as any issues that might affect their particular hardware configuration.
hu: Ha még nem olvasta volna a kiadási megjegyzéseket, és rendelkezik internet-kapcsolattal, itt a nagyszerű lehetőség: kattintson az aláhúzott hivatkozásra. Szeretnénk, hogy elolvassa a kiadási megjegyzéseket a telepítés előtt, mert innen értesülhet a rendszer új képességeiről és a különféle hardverkonfigurációkat érintő esetleges problémákról.

source: Select your language and press the <guibutton>Continue</guibutton> button.
hu: Válassza ki a nyelvet majd nyomja meg a <guibutton>Folytatás</guibutton> gombot.

source: Checking that everything is fine...
hu: Elenőrizze, hogy minden rendben van…

source: In the next screen, make sure you're connected to a power source (if you're using a laptop), the Internet and that you have the recommended amount of disk space. Then press the <guibutton>Continue</guibutton> button.
hu: A következő képernyőnél bizonyosodjon meg róla, hogy a számítógép csatlakozik az elektromos hálózathoz (laptop használata esetén) és az internethez, valamint győződjön meg róla, hogy elegendő szabad lemezterület áll rendelkezésére az operációs rendszer telepítéséhez. Ezek után nyomja meg a <guibutton>Folytatás</guibutton> gombot.

source: Choosing an installation type
hu: Válassza ki a telepítés típusát

source: In the next screen you can assign your entire hard drive to Linux Mint or install it alongside other operating systems. Alternatively, you can also define and assign the partitions manually.
hu: A következő képernyőnél az egész merevlemezt hozzárendelhet a Linux Mint operációs rendszer használatához, vagy telepítheti a rendszert egyéb operációs rendszerek mellé. Alternatív megoldásként megadhat egyedi partíciók hozzárendeléseket kézzel.

source: If you choose to use the entire disk, its content will be erased and Linux Mint will be installed as the only operating system on your computer.
hu: Abban az esetben ha a teljes lemez felhasználását választja, annak tartalma törlésre kerül és kizárólag Linux Mint lesz az egyetlen operációs rendszer a számítógépen.

source: If you choose to install it alongside other operating systems, the installer will use the free space available on other partitions to create a new one for Linux Mint. You will be asked how much space you want to allocate to it. The installer will then shrink a partition and take care of everything for you. Post-installation your computer will have a boot screen from which you'll be able to boot all your operating systems.
hu: Ha úgy dönt, hogy más operációs rendszerek mellé telepíti, akkor a telepítő felhasználja a más partíciókon lévő szabad lemezterületet és létrehoz egy új partíciót a Linux Mint számára. A telepítő megkérdezi majd, hogy mennyi tárterületet foglaljon le az új partíció számára. A telepítő ezután lecsökkenti az átméretezendő partíció méretét és gondoskodik minden szükséges teendő elvégzéséről. A telepítés után a számítógép egy rendszerindító menüvel fog elindulni, ahol választhat az elindítható összes telepített operációs rendszer közül.

source: If you choose to specify partitions manually, a partition editor will appear, giving you full control over the partitioning of your hard drive. This is recommended only to advanced users who understand how partitioning works under Linux. Note that Linux Mint requires a partition of at least 6GB and that the recommended size for a swap partition is 1.5 times the amount of RAM available on the computer.
hu: Ha azt választja, hogy kézzel szeretné a partíciókat szerkeszteni, akkor megjelenik a partíciószerkesztő, amellyel teljes irányítást kap a merevlemez particionálása felett. Az az üzemmód csak haladó felhasználóknak javasolt, akik tudják hogyan működik a particionálás Linux alatt. A Linux Mint minimum egy 6 Gigabájtos partíciót igényel és a cserefájl partíció mérete a számítógépben lévő memória másfélszerese.

source: The installation summary screen
hu: A telepítést összefoglaló képernyőkép

source: Choose the appropriate option and click on the <guibutton>Install Now</guibutton> button. At this stage, the installation is going on in the background and the installer asks you setup questions:
hu: Válassza ki a megfelelő lehetőséget, majd kattintson a <guibutton>Telepítés</guibutton> gombra. ilyenkor a telepítés a háttérben folytatódik és a telepítő megkérdezi a rendszer beállításához szükséges kérdéseket.

source: Choosing a timezone
hu: Időzóna kiválasztása
