Repository: KAMI911/cinnamon-l10n-hu
Catalog: user-guide-cinnamon-desktop-*.po
Languages: hu

source: Introduction to the Desktop
hu: A munkaasztal bemutatása

source: The <wordasword>desktop</wordasword> is the component of the operating system which is responsible for the elements that appear on the desktop: The <wordasword>Panel</wordasword>, the <wordasword>Wallpaper</wordasword>, the <wordasword>Control Center</wordasword>, the menus... etc.
hu: A <wordasword>Munkaasztal</wordasword> az operációs rendszer azon összetevője, amely többek között a következő dolgokért felel: a <wordasword>Panel</wordasword>ek megjelenése, a <wordasword>háttérképek</wordasword> kezelése, a <wordasword>Rendszerbeállítások</wordasword>, a menük megjelenítése és még sok minden másért is.

source: The Cinnamon Edition of Linux Mint uses the Cinnamon desktop which is both intuitive and powerful.
hu: A Linux Mint operációs rendszer Cinnamon kiadása a Cinnamon munkaasztalt használja, amely egyszerre intuitív és hatékony.

source: The Menu
hu: A menü

source: In Cinnamon, almost everything is accessible from the 'Menu'. To open it, click on <guimenu>Menu</guimenu> at the bottom-left of your screen, or press <keycombo><keycap>Ctrl</keycap><keycap>Super_L</keycap></keycombo> (Super_L is the left Windows key on your keyboard).
hu: A Cinnamon munkaasztalon, majdnem minden elérhető a „Menüből”. A megnyitásához kattintson a <guimenu>Menü</guimenu> gombra a képernyő bal alsó sarkában, vagy nyomja meg a <keycombo><keycap>Ctrl</keycap><keycap>Super_L</keycap></keycombo> billentyű-kombinációt. A Super_L billentyű a bal Windows gomb a billentyűzeten.

source: The Cinnamon Menu
hu: A Cinnamon menü

source: The menu is used to launch applications, to access the system settings, and to reach common places and open recent files.
hu: A menü használható az alkalmazások indítására valamint a rendszerbeállítások, a saját helyek valamint a legutóbb megnyitott fájlok elérésére.

source: Places
hu: Helyek

source: In Linux Mint, all your personal data is stored in your <wordasword>Home</wordasword> directory.
hu: A Linux Mint minden személyes adatát a <wordasword>Saját mappa</wordasword> mappában tárolja.

source: As well as your files, this directory also contains pre-defined sub-directories such as <wordasword>Documents</wordasword>, <wordasword>Music</wordasword>, <wordasword>Videos</wordasword>...etc which you can use to better organize your files.
hu: A fájljain kívül ez a könyvtár az alábbi előre létrehozott könyvtárakat is tartalmazza: <wordasword>Dokumentumok</wordasword>, <wordasword>Zene</wordasword>, <wordasword>Videók</wordasword>… stb., annak érdekében, hogy Ön könnyedén rendszerezhesse az fáljait.

source: Other important places are your <wordasword>Desktop</wordasword> folder (which containsn the files visible on your desktop), the filesystem (which contains all system files and directories), removable devices connected to the computer, the network and bookmarks (you can bookmark any directory to gain quick-access to it).
hu: További fontos helyek: az Ön <wordasword>Asztal</wordasword> mappája, amely az Asztalon található fájlokat tartalmazza. A Fájlrendszer, ahol az összes rendszerfájlt és mappát találja. A számítógéphez csatlakoztatott eltávolítható eszközök, a Hálózat, valamint a Könyvjelzők. Bármely mappát beteheti a könyvjelzők közé, így az a későbbiekben gyorsabban elérhetővé lesz.

source: To quickly access one of these places, perform one of the following actions:
hu: Ezeknek a helyeknek a gyors eléréséhez a következőket kell tennie:

source: Click on <guimenu>Menu</guimenu> and select <guisubmenu>Places</guisubmenu>
hu: Kattintson a <guimenu>Menü</guimenu> gombra és válassza ki a <guisubmenu>Helyek</guisubmenu> menüelemet.

source: Launch <wordasword>Nemo</wordasword>, the Cinnamon file manager, by clicking on <guimenu>Menu</guimenu> and selecting <guimenuitem>Files</guimenuitem>. Then, within Nemo, you can access common places by clicking on them in the sidebar, on the left of the window.
hu: A <guimenu>Menü</guimenu> gombra kattintva, majd a <guimenuitem>Fájlok</guimenuitem> menüelemre kattintva indítsa el a <wordasword>Nemo</wordasword> programot, amely a Cinnamon fájlkezelője. A Nemo programban könnyedén elérheti a leggyakrabban használt helyeket úgy, hogy az ablak bal oldalán lévő oldalsávon a nevükre kattint.

source: Nemo, the file manager, listing the content of the Home directory and providing quick-access to common places from the left sidebar.
hu: A Nemo fájlkezelő kilistázza a Saját mappa tartalmát és gyors elérést biztosít leggyakrabban használt helyekhez az ablak bal oldalán található oldalsávval.

source: System Settings
hu: Rendszerbeállítások

source: To launch the system settings, click on <guimenu>Menu</guimenu> and select <guimenuitem>System Settings</guimenuitem>.
hu: A rendszerbeállító elindításához nyomja meg a <guimenu>Menü</guimenu> gombot és válassza a <guimenuitem>Rendszerbeállítások</guimenuitem> menüpontot.
