Repository: KAMI911/cinnamon-l10n-hu
Catalog: user-guide-common-tipstricks-*.po
Languages: hu

source: Tips and Tricks
hu: Tippek és trükkök

source: Are you making the most of your desktop? Do you usually press <keycombo><keycap>Ctrl</keycap><keycap>C</keycap></keycombo> on your keyboard to copy some text? Do you open a text editor to take a quick note? How do you share files with your friends? There are many ways to perform simple tasks, some more efficient than others. This chapter is going to show you a few particularities of the Linux Mint desktop, to make sure you make the most of your system.
hu: Biztos benne, hogy a legtöbbet hozza ki az asztalából? Szövegek másolásakor a <keycombo><keycap>Ctrl</keycap><keycap>C</keycap></keycombo> billentyűkombinációt használja? Szövegszerkesztőt használ jegyzeteléshez? Hogyan oszt meg fájlokat a barátaival? Ezeket az egyszerű feladatokat sokféleképp elvégezheti, de ezek közül néhány hatékonyabb, mint a többi. Ez a fejezet bemutatja a Linux Mint asztali környezetnek néhány sajátosságát, hogy ezekkel a legtöbbet hozhassa ki a rendszeréből.

source: Copy and paste with the mouse!
hu: Másolás és beillesztés az egérrel.

source: Most people are used to clicking on the <guimenu>Edit</guimenu> menu or to right clicking on the content they want to copy. In Linux Mint you can do this as well, but you can also copy and paste content from the comfort of your mouse. Here's how it works: The left button of the mouse copies and the middle button pastes. It's as simple as that!
hu: Régebben a legtöbben a <guimenu>Szerkesztés</guimenu> menüben vagy a tartalomra való jobb egérkattintással másolták a tartalmaz. Linux Mintben is lehet így, de pusztán az egér használatával is tud másolni illetve beilleszteni tartalmat. Így működik: az egér bal gombjával másol, a középsővel beilleszt. Ilyen egyszerű!

source: Let's give it a try. Launch LibreOffice Writer or a text editor, or any application of your choice that lets you input text. Now type a few sentences. Select some of the text you just typed with the left button of your mouse. Think you need to click on the <guimenu>Edit</guimenu> menu and press <guimenuitem>Copy</guimenuitem>? No? Bet you're thinking you would use a combination of keys on your keyboard such as <keycombo><keycap>Ctrl</keycap><keycap>C</keycap></keycombo>. In Linux, it is much simpler. Just by selecting the text, you've already copied it. That's right... that text is now copied to your mouse buffer and you don't need to press anything else.
hu: Próbálja ki. Indítsa el a LibreOffice Writert vagy egy szövegszerkesztőt, vagy bármilyen alkalmazást, amibe szöveget tud gépelni. Írjon le pár mondatot, jelölje ki bal egérgombbal egy részét a szövegnek, amit begépelt. Gondoljon arra, mintha a <guimenu>Szerkesztés</guimenu> menüben a <guimenuitem>Másolás</guimenuitem> menüpontra kattintott volna. Biztosan arra gondol, hogy esetleg a <keycombo><keycap>Ctrl</keycap><keycap>C</keycap></keycombo> billentyűkombinációt is használhatná. Linuxban ez sokkal egyszerűbb. Pusztán azzal, hogy kijelölte a szöveget, már át is másolta az egér pufferébe és nem kell semmi másra kattintani.

source: Now click on some other part of the document to move the cursor there and click the middle button of your mouse (or the wheel-click if you have a mouse with a wheel). As you can see the text you previously selected has now been pasted.
hu: Most kattintson a dokumentum más részére hogy a kurzort oda helyezze és kattintson az egér középső gombjával (vagy a görgővel – ha van ilyen). A korábban kijelölt szöveg bemásolásra kerül.

source: The more you get used to this the faster you'll get at copying and pasting content.
hu: Minél többet használja, annál gyorsabban fogja tudni másolni és beilleszteni a különböző tartalmakat.

source: The buffer used by the mouse is not the same as the one used by the desktop. So you can actually copy something with your mouse and copy something else with <keycombo><keycap>Ctrl</keycap><keycap>C</keycap></keycombo> or with the <guimenu>Edit</guimenu> menu. Thanks to this you can copy two elements at a time and depending on how you copied them you can paste them with either the middle mouse button or with <keycombo><keycap>Ctrl</keycap><keycap>V</keycap></keycombo> or the <guimenu>Edit</guimenu> menu.
hu: Az egér puffere különbözük attól, amit az asztali környezet használ. Ez azt jelenti, hogyha másolunk valamit az egérre, másolhatunk valami mást a <keycombo><keycap>Ctrl</keycap><keycap>C</keycap></keycombo> vagy a <guimenu>Szerkesztés</guimenu> menü segítségével. Ennek köszönhetően kétféle dolgot is másolhatunk egyszerre és attól függően hogy hogyan másoljuk, beilleszhetjük az egér középső gombjával vagy a <keycombo><keycap>Ctrl</keycap><keycap>V</keycap></keycombo> illetve a <guimenu>Szerkesztés</guimenu> menü segítségével.

source: Take notes with Tomboy
hu: Készítsen feljegyzéseket a Tomboy jegyzettömbbel

source: We all take notes. Whether it's an address given by someone over the phone, an ever-growing TODO list or some particular thing to remember, we're often faced with the situation where we need to take a quick note. Some of us have a lot of written notes around our computers and never seem to find a working pen when the situation arises, others waste time in launching tools that are not suitable for this particular use (LibreOffice Writer for instance is not very handy to take notes) and very few people actually use software dedicated to note-taking. Linux Mint happens to include a dedicated note-taking tool. It is called Tomboy Notes.
hu: Mindannyian készítünk jegyzeteket. Legyen ez valakinek a címe, amit telefonon diktál be valaki, vagy egy folyamatosan növekvő lista a tennivalóinkról esetleg egy emlékeztető, gyakran előfordul hogy gyorsan le kell jegyeznünk valamit. Sokakat ellepnek a kisebb papírok a számítógép körül és mikor épp nagy szükségük lenne rá, nem találnak tollat, mások időt vesztegetnek olyan programok használatával, amik nem erre valók (a LibreOffice Writer nem épp jegyzetkészítésre való) és valójában nagyon kevesen használnak olyan programot, ami kifejezetten jegyzetelésre való. A Linux Mintben van ilyen eszköz: Tomboy jegyzettömbnek hívják.

source: Tomboy Notes
hu: Tomboy jegyzettömb

source: Tomboy Notes is a very easy tool to use. By clicking on it you get a list of all your notes. You can create new notes by clicking on <guibutton>Create New Note</guibutton>.
hu: A Tomboy jegyzettömb nagyon egyszerűen használható. Rákattintva az összes jegyzet listája látható. Új jegyzetet az <guibutton>Új jegyzet készítése</guibutton> gombra kattintva készíthet.

source: A new note opens up. By changing its title you'll also change its name. You can write whatever you want in the note and close it. The content you wrote in your note will always be accessible through Tomboy Notes; You don't need to save anything and you can even reboot or turn off the computer. Again, your note is saved automatically as you're writing it.
hu: Egy új jegyzetet nyitunk meg. A cím változtatásával a jegyzet nevét is megváltoztatjuk. Beleírhatjuk amit szeretnénk, majd bezárhatjuk. A jegyzet tartalma mindig elérhető lesz a Tomboy jegyzettömbön keresztül. Nem szükséges menteni, akár újraindíthatjuk vagy ki is kapcsolhatjuk a számítógépet. Ismétlem, írás közben minden jegyzet folyamatosan mentésre kerül.

source: If you eventually decide that you no longer need to keep a particular note, you can open that note and click on the <guibutton>Delete</guibutton> button.
hu: Ha végül úgy dönt, nincs már szüksége egy adott jegyzetre, megnyithatja és törölheti a <guibutton>Törlés</guibutton> gombra kattintással.

source: If you write down the name of another note's title within your note, Tomboy will automatically create a link to that other note and you'll be able to click that link to open the other note.
hu: Ha egy jegyzetben leírja egy másik jegyzet címét, a Tomboy automatikusan linket készít a másik jegyzetre, amire rákkattintva meg is nyithatja a hivatkozott jegyzetet.

source: You can also use different formatting options within your note and use the many features provided by Tomboy Notes (synchronization, search features, export notes to PDF/HTML...etc).
hu: Használhat különböző formázási lehetőségeket a jegyzetben és a Tomboy jegyzettömb számos egyéb szolgáltatást is nyújt (szinkronizáció, jellemzők keresése, jegyzetek exportálása PDF-be vagy HTML-be).
