Repository: KAMI911/cinnamon-l10n-hu
Catalog: user-guide-common-softwaremanagement-*.po
Languages: hu

source: Software Management
hu: Szoftverkezelés

source: If you have installed Linux for the first time, then you may not be familiar with the concept of organizing software into <wordasword>packages</wordasword>.
hu: Ha először telepített Linuxot, talán nem ismeri a szoftverek <wordasword>csomagokba</wordasword> szervezésének koncepcióját.

source: You will soon become familiar with package management and appreciate the advantages it offers in terms of security, control and ease of use.
hu: Hamarosan megismerheti a csomagkezelés lényegét és azokat az előnyöket, amiket a biztonság, a felügyelet és a könnyű kezelhetőség terén nyújt mindez.

source: We have tried to make it so that all or most of your hardware was detected and drivers were installed automatically so that your computer would work out of the box. We have also tried to make it so that you could do many of the things you want to without having to look around for third party software on websites. You may have noticed that your Linux Mint installation already has a full office suite, a professional-quality image-editing solution, an IM and an IRC client, a disk burner, and several media players (as well as many other basic accessories). Relax, it's okay! You haven't stolen anything! This is what free software is all about! And the truly great thing about package management in Linux Mint and generally is that you should never need to look far and wide for extra software, even when the time comes that you do want more functionality from your Linux Mint system.
hu: Megpróbáltuk olyan módon elkészíteni, hogy az összes vagy a legtöbb hardverét és azok illesztőprogramját automatikusan telepítse a számítógépére, így az rögtön működésre kész. Azt is megpróbáltuk, hogy a legtöbb dolgot harmadik fél által készített szoftver telepítése nélkül tudja használni. Talán észrevette, hogy az Ön Linux Mint operációs rendszere teljes irodai programcsomagot, professzionális szintű képszerkesztő megoldást, azonnali üzenetküldő és IRC klienst, DVD-lemezíró alkalmazást és jó néhány médialejátszót tartalmaz (sok egyéb apró kelléken kívül). És mindez, a lehető legnagyobb rendben van. Semelyik összetevő sem lopott szoftver. Erről szól a szabad szoftverek világa! A Linux Mint csomagkezelésének igazán nagyszerűsége pont az, hogy nem szükséges hosszan keresgélnie a további szoftverek eléréséhez akkor sem, amikor több funkcionalitást vár a Linux Mint rendszerétől.

source: This section is intended to explain how this works and the advantages that it can bring to you. It's a bit long, but hopefully it will provide you with a good understanding of the philosophy behind package management and why it is considered a Good Thing (a phrase commonly capitalized by Linux users to mean that something is squarely in the category of good). If you're in a hurry, you can skip to the next section which will tell you how to actually use the package system.
hu: Ez a szakasz megpróbálja elmagyarázni hogyan működik, és milyen előnyöket hoz Önnek. Egy kicsit hosszú lesz, de remélhetőleg jó áttekintést ad a csomagkezelés filozófiájáról és hogy ez miért is számít Jó Dolog-nak (ezt a kifejezést a Linux felhasználók gyakran írják nagy kezdőbetűkkel, ha valami egyértelműen jó). Ha sietős a dolga, átugorhatja a következő szakaszt, hogy megtudhassa, miként is működik valójában a csomagkezelő rendszer.

source: The problems with browsing software vendors' websites and downloading and installing the software they offer are many:
hu: Sokféle probléma lehet abból, ha szoftverfejlesztők weboldalait böngésszük és az ő szoftvereiket telepítjük:

source: It is difficult or impossible to find out if the software has been tested to work with your operating system
hu: Nehéz vagy lehetetlen kitalálni, hogy a szoftvert tesztelték-e, s működik-e az operációs rendszerünkkel

source: It is difficult or impossible to know how this software will interact with the other software installed on your system
hu: Nehéz vagy lehetetlen megtudni, hogy ez a szoftver hogyan működik együtt a rendszerünkön lévő többi szoftverrel

source: It is difficult or impossible to know if you can place your trust that software from an unknown developer software will not cause any harm, willful or negligent, to your system Even if you know about a specific piece of software and its developer, you cannot be entirely sure that you are not downloading an executable that has been swapped out by a malicious third party for some type of malware.
hu: Nehéz vagy lehetetlen megtudni, hogy egy ismeretlen fejlesztő szoftverében bízhatunk-e, vajon nem fog véletlenül vagy szándékosan kárt okozni a rendszerünkben. Még ha ismerünk is egy bizonyos szoftvert vagy a fejlesztőjét. nem lehetünk egészen biztosak benne, hogy a letöltött futtatható állományokat nem cserélte le valamilyen harmadik fél vagy kártevő program.

source: Furthermore, a problem with downloading and installing multiple different programs, from multiple different developers, is that there is no managerial infrastructure. Before you say “big deal”, consider how you are going to keep all these different pieces of software up to date. If you get tired of a program and want to remove it, how do you know how to achieve that? The program in question might not have come with a removal option, and even if it did, much of the time this will fail to remove the software cleanly and completely. In a very real sense, when you ran that installer program, you gave up some of your control of your computer to a program written entirely by a complete stranger.
hu: További probléma a sokféle, sok helyről letöltött szoftverekkel, hogy nincs közös kezelői infrastruktúra. Mielőtt azt mondja, hogy „nagy dolog”, gondolja végig, hogyan fogja ezeket frissíteni? Ha egy program már nem kell, honnan tudja majd, hogyan kell letörölni? Talán a kérdéses programnak nincs is eltávolítási funkciója. De ha van is, sok esetben nem lehet teljesen és tisztán törölni őket. Máshonnan nézve: Amikor annak a programnak a telepítőjét elindította, valamilyen szinten feladta a számítógépének felügyeletét egy teljesen idegen kedvéért.

source: Finally, software which is distributed in this way is often, by virtue of necessity, “static”. This means that not only do you need to download the program itself, but also all of the data libraries that are required for it to run. Since a third-party software developer cannot know which data libraries you may already have available on your system, the only way that they can guarantee it will run on your system is by supplying all of the data libraries it needs along with the program itself. This means bigger downloads, and it means that when the time comes to update a given library, it needs to be done separately for all those programs using it, instead of just once. In summary, the distribution of static software results in the unnecessary duplication of a lot of work.
hu: Végezetül az ilyen módon terjesztett szoftverek szükségszerűen „statikusak”. Ez az jelenti, hogy Önnek nem csak a programot kell letöltenie, hanem a futtatáshoz szükséges programkönyvtárakat is. Mivel a harmadik fél által készített szoftver fejlesztője nem tudja, hogy az Ön rendszerén mely programkönyvtárak vannak már telepítve, az egyetlen módja, hogy garantálja az általa készített program futtathatóságát, ha a program futtatásához szükséges összes programkönyvtárat mellékeli a programhoz. Ez a gyakorlatban nagyobb nagyobb letöltéseket, illetve azt is jelenti, hogy ha a megadott programkönyvtár frissítésre szorul akkor az összes – programkönyvtárat használó – programnál külön-külön frissíteni kell ahelyett, hogy csak egyszer kellene frissíteni. Összegezve a statikus programok terjesztése sok szükségtelen többletmunkát okoz.

source: Package management in Linux Mint, and GNU/Linux operating systems in general, has been established for some time and is the preferred method for managing software as it avoids all of these issues. We've been safely and automatically installing our software since the early 1990s.
hu: A Linux Mint és a GNU/Linux operációs rendszerek csomagkezelése, már rég óta jól működő és javasolt eljárás a szoftverkezelés feladatok ellátására és mentes a fenti problémáktól Segítségével az 1990-es évek elejétől mindannyian biztonságosan és automatikusan telepíthetjük szoftvereinket.

source: Software is first written by a developer, as you might expect, and this end of the production chain is known as “upstream”. As a user of a Linux distribution, you are referred to as being at the furthest point “downstream” (unless you're an admin, in which case your users are the furthest point downstream, but you knew that because you're an admin). Once the developer is happy with the program or the update to the program they have written, they will release the source code for it. They will also communicate in their documentation which data libraries or other programs they took advantage of when they were writing the program. They have been doing this for some time and there are standardized and venerable ways for them to do this. Note that, with a few exceptions (usually either hardware manufacturers who release drivers for Linux, like nVidia or ATI, or certain major companies like Adobe, who we can trust) they release the actual source code for the program, that is, the list of instructions in that program in a human readable form. This has a number of implications, but most importantly for this discussion it means that they are willing to have their software peer reviewed by anyone and everyone with an Internet connection. It's awfully difficult to sneak spyware into your program when you're letting everyone see what you've written!
hu: A szoftvert elsőként a fejlesztő írja, ahogy az sejthető volt. A termelési lánc ezen végét „upstream”-nek hívják. Linux disztribúció felhasználójaként úgy említik Önt, hogy a legtávolabbi pont, azaz "downstream" (kivéve, ha Ön egy rendszergazda, mely esetben az Ön felhasználói a legtávolabbi pont, azaz a „downstream”, de akkor ezt tudja, hiszen Ön a rendszergazda). Miután a fejlesztő elégedett a programmal vagy a frissít egy programot, amelyet mások írtak, kiadják a forráskódokat. Emellett a fejlesztők leírják a dokumentációban, hogy milyen programkönyvtárakra és egyéb eszközökre van szükség a program használatához és fejlesztéséhez. Ők már ezt jó ideje ezzel foglalkoznak, és mindezt szabványosított és elfogadott módon teszik. Ne feledje, hogy néhány kivételtől eltekintve (általában hardvergyártók, akik eszközmeghajtókat készítenek Linuxra, mint az NVIDIA, vagy az ATI, esetleg bizonyos nagyvállalatok, mint az Adobe, amelyekben megbízhatunk) kiadják a programok tényleges forráskódját. Ez a forráskód, a program ember által olvasható formában megadott utasítások listája. A forráskód kiadásának számos kedvező következménye van, de ami most a legfontosabb számunkra, hogy a szoftvert bárki és mindenki szakértői szemmel megvizsgálhatja egy Internet kapcsolat birtokában. Ez borzasztóan nehézzé teszi besurranó kártékony kódok beépítését a programba, hiszen mindenki látja, amit a program fejlesztője írt!

source: The software now moves down the stream to package maintainers, who are either volunteers or paid employees working for a Linux distribution. It is their responsibility to compile the source code for the software, test it on the distribution to make sure that it works, resolve any problems that they encounter and finally package the compiled (i.e., machine-readable) software in a convenient format. This package contains the executable program(s), their configuration files, and the instructions the package management software needs to successfully install it. Note that it won't ordinarily contain any static libraries, since it doesn't need to – the libraries are provided by other packages, and are therefore known as shared libraries. Your package management software will know if that a particular package requires another package to be installed first (like a shared library), because, as you will remember, the data libraries and related packages needed for the software to work were declared further upstream and that information is included in the package. The instructions are sufficiently detailed that even specific versions of other packages can be requested to ensure interoperability. The finished package is then uploaded to a special file server, which is called a software repository.
hu: A szoftver így eljut a csomag karbantartóihoz, akik lehetnek a Linux disztribúciónál dolgozó önkéntesek vagy fizetett alkalmazottak. Az ő felelősségük, hogy a szoftver forráskódját lefordítsák, futtatható programot készítsenek belőle, majd ezek után tesztelik disztribúción, hogy megbizonyosodjanak működőképességéről, megoldják a felmerülő problémákat és végül elkészítsék a kényelmes formátumban a lefordított programok csomagjait (számítógép által olvasható formátumban). Ez a csomag tartalmaz futtatható programokat, ezek konfigurációs állományait, és a csomagkezelő szoftver számára telepítési utasításokat. Megjegyezendő, hogy nem tartalmaz statikus programkönyvtárakat – hiszen nincsen rájuk szükség – mert a programkönyvtárak más csomagból kerülnek telepítésre. Ezeket közös programkönyvtáraknak nevezzük. A csomagkezelő szoftver tudni fogja, hogy mely csomag telepítéséhez, milyen további csomagok előre telepítése szükségeltetik (mint egy közös programkönyvtár), mert a szoftver számára szükséges programkönyvtárak és szükséges csomagokat a szoftverkészítő megadja, így ez az információ belekerül a csomagba is. Ez a leírás kellőképpen részletes – a kompatibilitás érdekében – megadja a telepítendő csomagok kívánt verzióit is. Az elkészült csomag felkerül egy különleges fájlkiszolgálóra, amelyet csomagtárolónak neveznek.

source: It is from that single location that you are able to download and install the software you need. You will know that the location is bona fide, because it is signed with a certificate that your package manager will check. You will also know that each individual package that you install is secure, because each package is itself signed by a GPG key, which your package manager will also check. Your package manager will even run an MD5 sum on each package to make sure that nothing went wrong when it was downloading, just like we did before with the LiveDVD iso. Notice how it's doing all of this for you. You're just sitting back, sipping a martini, and chatting in #linuxmint on xchat. The package manager has downloaded the packages you have selected, it will follow, to the letter (computers are fastidious in following instructions), the instructions in the package to perfectly install your software, and all of its dependencies, in the right order. There is no space for human error – if the package worked on the maintainer's computer, then it ought to on yours because the package manager will follow exactly the same procedure.
hu: Ez az egyetlen hely ahonnan – igény szerint – le tud tölteni és fel tud telepíteni szoftvereket. Biztos lehet benne, hogy ez a hely megbízható, hiszen tanúsítvánnyal igazolja megfelelőségét, amelyet a csomagkezelő ellenőrizni fog. Továbbá minden egyes telepítendő csomag biztonságáról is meggyőződhet, mert minden csomag GPG kulccsal van aláírva, amelyet a csomagkezelő szintén ellenőriz. A csomagkezelő ezen felül ellenőrzi a csomagok MD5 ellenőrzőösszegét is, hogy megbizonyosodjon róla, hogy a csomag nem sérült meg letöltés közben, ahogy azt Ön is tette nem sokkal a LiveDVD lemezképfájllal. Nézze csak, hogy mit is jelent ez valójában az Ön számára. Csak dőljön hátra kedvenc italát kortyolgatva és a #linuxmint csatornán csevegve az xchat alkalmazásban. A csomagkezelő letölti a kiválasztott csomagokat, majd az előre megadott utasítások szerint tökéletesen telepíti a megadott szoftvert minden függőségével együtt, a megfelelő sorrendben. Nincs lehetőség emberi hibára – ha a csomag működött a csomag karbantartójának számítógépén, működni fog az Ön számítógépén is – mert a csomagkezelő ugyanazt a jól meghatározott telepítési procedúrát követi.

source: When it comes time to check for software updates, your package manager will automatically compare the software version that you have against what is available in the repository, and do all the necessary work to keep your system running smoothly and securely. So, if version 2.4 of BestSoft is uploaded to the repository, and you have version 2.3, the package manager will compare those version numbers, and offer to install the latest version, taking care, of course, of all the dependencies for the newer version of the software.
hu: Amikor eljön az ideje a szoftverek frissítéseinek ellenőrzésének, a csomagkezelő automatikusan ellenőrzi a szoftververziókat és frissíti a csomagokat a rendszer biztonsága és a simább futása érdekében. Amennyiben a a „Legjobbproggi” 2.4-es verziója feltöltésre került a csomagtárolóba és Önnek a 2.3-as verzió van meg, akkor a csomagkezelő össze fogja ezeket verziókat hasonlítani és felkínálja a legújabb verzió telepítésének lehetőségét – ügyelve a függőségek kezelésére.

source: Sounding good yet? It gets better.
hu: Eddig jól hangzik? Még ennél is jobb lesz!

source: Humans err where computers don't and from time to time something may go wrong in this process. Perhaps you will, by accident, install hardware drivers for the wrong piece of hardware and this might break something. We've all done that. Or perhaps there's a bug or your favorite feature was removed by the program's developer for some reason. These problems demonstrate, paradoxically, the strength and security of package management. Because your package manager keeps fastidious records of everything it ever does, it is able to reverse installations, cleanly and completely. It will make sure that removing one package doesn't break any others, and you can even tell it specifically to do things like not automatically upgrade certain packages, because you like them the way they are, or to revert to an earlier version. Finally, the whole process is very heavily peer-reviewed. Because you are part of a large community of Linux users, all using the same repositories to obtain their software, if anything goes wrong you can be absolutely sure there will be a big fuss about it, and that the problem will be resolved quickly! In this way, software distribution in GNU/Linux distributions is very much based on trust, from the moment the original developer displays their source code for all to see, to the open discussion on the distribution's website. You can be confident in the software you obtain, not only because of the security protocols already mentioned, but because if anything does go wrong everyone will be talking about it!
hu: Az emberek hibázhatnak, ahol a számítógépek nem és időről-időre előjöhet valami hiba ebben a folyamatban. Például ha véletlenül nem megfelelő hardverhez telepít eszközmeghajtókat és az elront valamit a rendszeren. Mindannyiunkkal előfordulhat. Vagy talán valamilyen okból van egy hiba, vagy a kedvenc szolgáltatását eltávolította a program fejlesztője. Ezek a problémák paradox módon bizonyítják azt az erőt és a biztonságot, amelyet a csomagkezelés nyújt. Mivel a csomagkezelő részletes nyilvántartást vezet a számítógépen végrehajtott valamennyi változtatásról, képes tökéletesen és teljesen eltávolítani a feltelepített szoftvereket. Ez a megoldás garantálja, hogy egy csomag eltávolítása nem fogja tönkretenni a többiek működését. Ugyanígy meghatározhatja, hogy a megadott csomagokat ne frissítse a csomagkezelő, mert Ön szerint a jelenlegi helyzet megfelelő, vagy mert visszatért a telepített szoftver egy előző verziójára. Végül, az egész folyamat nagyon erősen lektorált. Mivel Ön tagjává vált Linux felhasználók egyik nagy közösségének, ahol mindenki a szoftverek beszerzéséhez azonos csomagtárolókat használ. Ha bármi probléma lépne fel, biztos lehet benne, hogy hamar nagy felhajtás lesz körülötte, és a problémát gyorsan megoldják. ilyen módon a szoftver terjesztés a GNU/Linux disztribúciókban a bizalmon alapul, attól kezdve, hogy a program eredeti fejlesztője mindenki számára láthatóan közzéteszi a forráskódot, egészen a disztribúció weboldalán folytatott nyitott párbeszédig. Nem csak a szigorú biztonsági előírások miatt bízhat meg az Ön által letöltött szoftverben, hanem mert ha valami rosszul sül el, akkor arról mindenki beszélni fog.

source: Let's look again at our list of problems and see what we have solved:
hu: Tekintsük át ismét a listát és nézzük meg milyen problémákat kerülhetünk el:

source: Problem
hu: Probléma

source: Solution
hu: Megoldás

source: It is difficult or impossible to find out if the software has been tested to work with your operating system.
hu: Nehéz vagy lehetetlen megállapítani, hogy melyik szoftvert melyik operációs rendszeren tesztelték.

source: You know that the software available to you through the repository has been thoroughly tested by the package maintainer and the testing team to work with your operating system. They won't want to get it wrong, mostly on principle, but also because if they do they'll soon be getting lots of emails.
hu: Biztos lehet benne, hogy a csomagtárolóból kizárólag – a csomag karbantartója és a tesztelőcsapat által – alaposan tesztelt csomagok érhetők el, amelyek működni fognak az operációs rendszerével. Ők elvből nem akarják, hogy valami hiba legyen, de azért sem, mert ha valami rossz lenne, akkor hirtelen nagyon sok levelet kapnának.

source: It is difficult or impossible to know how this software will interact with the other software installed on your system.
hu: Nehéz illetve lehetetlen megmondani, hogy ez a szoftver, hogyan fog együttműködni a rendszerére már telepített szoftverekkel.

source: Similarly, package maintainers try their utmost to ensure that packages won't conflict with other packages offered by their distribution. Of course, they might not have every last package installed on their testing machines (in fact, usually package maintainers build their packages on clean installations to ensure that they are standard), but if a member of the user community finds out that there is a problem, they will no doubt let the distribution team know, and the problem will be fixed, or at least worked on. Unless you are a beta tester, then you are unlikely to ever see such a conflict, because that's what beta testing is for.
hu: A csomagok karbantartói mindent megtesznek azért, hogy a disztribúcióhoz ajánlott csomagok ne ütközzenek egymással. Természetesen a tesztelők nem feltétlenül telepítik az összes ajánlott csomagot a teszteléshez használt gépre (valójában a csomag karbantartói a csomagjaikat egy újonnan telepített gépen fordítják le, így biztosítva hogy szabványos a rendszerük), de ha a felhasználói csoport valamely tagja problémába ütközik, a fejlesztői csapatot értesíti a problémáról és azonnal javítják vagy legalább elkezdenek dolgozni a javításon. Ha Ön nem beta tesztelő, nem valószínű hogy valaha ilyen csomag-ütközéssel találkozni fog, hiszen a beta-tesztelés egyik lényege, hogy ezeket a problémákat kiküszöbölik.

source: It is difficult or impossible to know if you can place your trust in the developer that their software will not cause any harm, willful or negligent, to your system.
hu: Nehéz vagy lehetetlen megtudni, hogy bízhat-e abban, hogy egy fejlesztő szoftvere nem okoz kárt, akár szándékosan, akár gondatlanságból.

source: Package maintainers are hardly likely to package software they know will harm people's computers (including their own)! Only software which is known and trusted will ever make it to the repository.
hu: A csomag karbantartója aligha csomagol be olyan csomagot, amelyről tudja, hogy elrontja a felhasználók számítógépét, beleértve a saját gépét is. Csak az ismert és megbízható szoftverek kerülnek be a csomagtárolóba.
