Repository: KAMI911/cinnamon-l10n-hu
Catalog: user-guide-common-installation-*.po
Languages: hu

source: Choose your location on the map by clicking on the city which is the nearest to you. The purpose of this step is to identify your time zone. Make sure the <guilabel>Current time</guilabel> appears correctly and click the <guibutton>Continue</guibutton> button.
hu: A térképen a legközelebb lévő városra kattintva adja meg tartózkodási helyét. Ezzel a lépéssel Ön megadja a használni kívánt időzónát. Ellenőrizze, hogy a <guilabel>Jelenlegi idő</guilabel> beállítás a helyes időt mutatja, majd nyomja meg a <guibutton>Folytatás</guibutton> gombot.

source: Sometimes the installer doesn't properly handle Summer/Winter time adjustments, so even by selecting the proper city you might see a difference of an hour or so with the correct time. Simply ignore this at this stage and remember to make sure that the time is correct after you reboot in your newly installed Linux Mint desktop.
hu: Néhány esetben előfordul, hogy a telepítő nem jól kezeli a téli és nyári időszámítást, így ha a megfelelő várost is választotta ki, akkor is egy óra különbséget lát a beállított és a valójában helyes idő között. Egyelőre hagyja figyelmen kívül ezt, de emlékezzen rá, hogy amikor az újonnan telepített Linux Mintet elindítja, kijavítsa majd ezt a hibát.

source: Choosing a keyboard layout
hu: Billentyűzetkiosztás kiválasztása

source: Select your keyboard layout. If you are not sure about exactly which layout matches the keyboard you have, click on the text field at the bottom of the screen and start typing with your keyboard. Make sure the keys you press match the characters that appear in the text field in order to ensure you have selected the right keyboard layout. Some layouts only differ with respect to accents, numbers and punctuation signs, so make sure to test these as well.
hu: Válassza ki a billentyűzet-kiosztást. Ha nem biztos benne, hogy melyik kiosztás felel meg a billentyűzetének, akkor kattintson a ablak alján található szövegmezőre. Ellenőrizze, hogy az Ön által lenyomott gombok pontosan azokat a karaktereket jelölik, amelyek megjelennek a szövegmezőben. Így eldöntheti, hogy a megfelelő billentyűzet-kiosztást választotta billentyűzetéhez. Néhány kiosztásban eltérő ékezethasználat, számok és írásjelek vannak, így tesztelje ezeket is.

source: When you’re ready click the <guibutton>Continue</guibutton> button.
hu: Amikor elkészült, nyomja meg a <guibutton>Folytatás</guibutton> gombot.

source: Enter your real name and a username and password. Every time you’ll use Linux Mint you’ll use your account with this username and password. Once Linux Mint is installed you’ll be able to define other accounts if other people are to use this computer.
hu: Írja be polgári nevét, felhasználónevét és jelszavát. Minden alkalommal, amikor a Linux Mintet használja ezt a felhasználói fiókot fogja használni, ezzel a felhasználónévvel és jelszóval. Amikor a Linux Mint telepítésével elkészült, akkor további felhasználói fiókokat is hozzá tud majd adni a rendszerhez, amennyiben több ember is használná ezt a számítógépet.

source: Also give your computer a name. This name will be used by your computer on the network or in various places of the system. If you’ve never really thought about naming your computers, then now is the time. People commonly pick flower (dahlia, rose, tulip) or planet (mars, jupiter, pluto) names for the computers on their network. It’s entirely up to you what you want to use, but make sure to pick a name you like and that you will easily remember.
hu: Továbbá adja meg a számítógép nevét. Ezt a nevet használja majd a számítógép a hálózaton és az operációs rendszer számos helyén. Ha még nem gondolkodott azon, hogy mi legyen a számítógép neve, akkor itt az idő. Az emberek gyakran virágok neveit (rozsa, tulipán, orchidea) vagy bolygók neveit (mars, jupiter, uranus) adják meg számítógépnévnek. Teljesen Önre van bízva, hogy milyen nevet válasz, de olyat válasszon amit kedvel és könnyen meg tud jegyezni.

source: Capital letters, spaces and special characters are not permitted in the username or in the name of the computer.
hu: Nagybetűk, szóközök, speciális karakterek nem megengedettek a felhasználónévben vagy a számítógép nevében.

source: If you're the only one using the computer and you want to bypass the login screen, check the option <guilabel>Log in automatically</guilabel>.
hu: Ha csak Ön használja a számítógépet, és nem szeretné hogy a bejelentkezési képernyő megjelenjen, kijelölheti az <guilabel>Automatikus bejelentkezés lehetőséget</guilabel>.

source: When you’re ready click on the <guibutton>Forward</guibutton> button.
hu: Amikor elkészült, nyomja meg a <guibutton>Folytatás</guibutton> gombot.

source: The user settings screen
hu: A felhasználói beállítások képernyőkép

source: The installer might detect other operating systems on your computer and ask you if you want to migrate some personal information. Typically this allows you to migrate bookmarks, contacts, favorites and other sorts of personal information from other operating systems installed on your hard disk drive into the newly installed Linux Mint. When you’re ready click on the <guibutton>Continue</guibutton> button.
hu: A telepítő lehet hogy felismeri más operációs rendszer jelenlétét a számítógépen és felajánlja néhány személyes információ migrálását. Tipikusan ilyenkor áthozhatja a könyvjelzőit, a kedvenceit, és egyéb személyes információit a merevlemezre telepített másik operációs rendszer alól, az újonnan telepített Linux Mint operációs rendszer alá. Ezek után nyomja meg a <guibutton>Folytatás</guibutton> gombot.

source: The installation usually takes between 10 and 15 minutes
hu: A telepítés álatában 10-15 percet vesz igénybe.

source: The installer will download packages from the Internet to support the language you’ve selected. Your computer needs to be connected to the Internet for this to work. Otherwise just <guibutton>skip</guibutton> that step and you’ll be able to add support for your language after the installation is finished and you’ve rebooted into your new system.
hu: A telepítő a kiválasztott nyelv támogatásához csomagokat fog letölteni az internetről. Ehhez a számítógépnek működő internet-kapcsolattal kell rendelkeznie. Abban az esetben, ha nincs működő internet-kapcsolat kattintson a <guibutton>Kihagyás</guibutton> gombra. Későbbiekben a kiválasztott nyelvi támogatást hozzáadhatja, amikor a telepítés befejeződött és elindította az új operációs rendszert.

source: Once the installation is done click the <guibutton>Restart Now</guibutton> button and the liveDVD or LiveUSB environment will shut down.
hu: Amikor a telepítés befejeződött kattintson <guibutton>Újraindítás</guibutton> gombra és a liveDVD vagy a LiveUSB környezet azonnal leáll.

source: When prompted, remove the DVD from the drive or remove the USB and press Enter. Your PC is now ready to boot Linux Mint from the hard drive.
hu: Amikor arra kéri a rendszer, távolítsa el a DVD-t a meghajtóból vagy az USB pendrive-ot a számítógépből, majd nyomja meg az „Enter” billentyűt. A számítógép most már készen áll a Linux Mint merevlemezről történő rendszerindítására.

source: Reboot the computer
hu: Számítógép újraindítása

source: Upon reboot, if you have more than one operating system installed, you should see a boot menu. Once Linux Mint is finished loading you should see a new screen inviting you to enter your username and password. This screen is the “MDM Login Manager” and is commonly called “MDM”. Enter the password you chose during the installation.
hu: Rendszerindítás közben – ha több mint egy operációs rendszer van a számítógépre telepítve – akkor a rendszerindító menü fog megjelenni. Válassza a Linux Mintet. Amikor a Linux Mint betöltődése befejeződött egy új képernyőt fog megjelenni, amely arra kéri Önt, hogy adja meg felhasználónevét és jelszavát. Ez a bejelentkezési képernyő, vagy más néven „MDM bejelentkezéskezelő”, vagy ahogy általában hívják: „MDM”. Válassza ki a telepítés során megadott felhasználónevet és írja be a jelszavát.

source: By default, your “root” password is the same as the password you chose during the installation. If you do not know what this means, then don't worry about it.
hu: A „root” jelszó alapértelmezésben megegyezik a rendszer telepítése során megadott jelszóval. Nem probléma, ha nem tudja, hogy ez mit jelent.
