Repository: KAMI911/cinnamon-l10n-hu
Catalog: user-guide-common-softwaremanagement-*.po
Languages: hu

source: The <guilabel>Include dist-upgrade packages</guilabel> option allows you to define whether the Update Manager should install new dependencies or not. For instance if package A version 1 was installed on your computer and package A version 2 became available, but version 2 had a new dependency on package B which isn't installed on your computer... what would happen?
hu: A <guilabel>Disztribúció-frissítő csomagok hozzáadása</guilabel> lehetőséggel megadhatja, hogy Frissítéskezelő telepítse-e a csomagok új függőségeit. Például: ha egy „A” csomag 1-es verziója telepítve van a számítógépén. A 2-es verzió elérhetővé válik és telepítési függősége van a „B” csomaghoz, amely még nincs telepítve a számítógépre. Mi legyen ilyenkor?

source: If you left this checkbox unchecked, version 2 would not appear as an update in the list of updates.
hu: Ha jelöletlenül hagyja ezt a jelölőnégyzetet, akkor a 2-es verzió nem fog megjelenni a frissítések listájában.

source: If you checked this checkbox, it would, and if selected it would install package B as a dependency.
hu: Ha bejelöli ezt a jelölőnégyzetet, akkor ha a B csomag ki van választva, mint függőség és telepítve lesz.

source: Be careful with this option as dependency can install new packages on your behalf but they can also sometimes remove packages you already have installed.
hu: Legyen óvatos ezzel a beállítási lehetőséggel, mivel függőség esetén nemcsak új csomagokat telepíthet fel, de az Ön nevében olykor eltávolíthat korábban telepített csomagokat.

source: In the <guilabel>Ignored packages</guilabel> tab you can define packages for which you do not want to receive updates. '?' and '*' wildcard characters are supported.
hu: A <guilabel>Mellőzött csomagok</guilabel> fülön beállíthatja, hogy melyik csomagokat nem szeretné frissíteni. Használhatók a „?” és a „*” helyettesítő karakterek.

source: The <guilabel>Proxy</guilabel> tab lets you define proxy settings.
hu: A <guilabel>Proxy</guilabel> fül segítségével beállíthatja a proxyt.

source: The last tab lets you change the icons used by the Update Manager in the system tray.
hu: A legutolsó fül segítségével kicserélheti a Frissítéskezelő értesítési panelen megjelenő ikonját.

source: If you get errors with the Update Manager, you can check the logs. Right click on the lock icon in the system tray and select <guilabel>Information</guilabel>. The following screen appears:
hu: Amennyiben hibát jelez a Frissítéskezelő, megnézheti a naplófájlokat. Jobb egérrel kattintson a zárolás ikonra az értesítési panelen és válassza az <guilabel>Információ</guilabel> gombot. A következő képernyőt fogja látni:

source: The Update Manager logs
hu: A Frissítéskezelő naplófájljai

source: In this screen you can see the process ID of the Update Manager and the content of its log file.
hu: Ezen a képernyőn láthatja a Frissítéskezelő folyamatazonosítóját és a hozzátartozó naplófájl tartalmát.

source: You can also review the updates that were applied on your system by clicking on the <guimenu>View</guimenu> menu and by selecting <guimenuitem>History of Updates</guimenuitem>.
hu: Áttekintheti a rendszeren végrehajtott frissítéseket, ha a <guimenu>Nézet</guimenu> menüre kattintva, és kiválasztja a <guimenuitem>Frissítési előzmények</guimenuitem> menüpontot.

source: The history of updates
hu: Frissítési előzmények
