Repository: KAMI911/cinnamon-l10n-hu
Catalog: user-guide-common-softwaremanagement-*.po
Languages: hu

source: Even if you know about a specific piece of software and its developer, you cannot be entirely sure that you are not downloading an executable that has been swapped out by a malicious third party for some type of malware.
hu: Még ha ismeri is az adott szoftvert vagy a fejlesztőjét, nem lehet teljesen biztos benne, hogy egy olyan végrehajtható fájlt tölt le, amit nem cserélt ki egy rosszindulatú harmadik fél egy kártékony programra.

source: In addition to the usual security measures put in place by the institutions who own the servers (usually prestigious academic or research institutions, or large companies), the repository and packages themselves are secured by certificates and GPG keys. If something's gone wrong, your package manager will tell you about it. The present author, in ten years of using Linux, has never once known anything to go wrong in this respect.
hu: Amellett, hogy a szokásos biztonsági intézkedéseket vezetnek be a saját szerverrel rendelkező intézmények (általában neves akadémiai vagy kutatóintézetek, vagy nagy cégek), a csomagtárolók és a csomagok maguk is tanúsítványokkal és GPG kulcsokkal hitelesítettek. Ha valami nem megfelelő, akkor a csomagkezelő ezt jelezni fogja. E leírás szerzője, tíz év Linux használat alatt nem találkozott ilyen jellegű hibával.

source: It is difficult to remove (all traces of) installed programs.
hu: Nehézkes minden telepített programot (és azok minden nyomát) eltávolítani.

source: Because the package management software keeps a complete record of all of its actions, it is quite capable of reversing any steps that it took in the past, while ensuring that removing one package will not cause any other package to fail.
hu: Mivel a csomagkezelő program képes az összes tevékenységét rögzíteni, képes arra is, hogy visszavonja a korábbi lépéseket, ezzel biztosítva, hogy egy csomag törlése nem okoz hibát más csomagok működésében.

source: Static packages are big and clunky.
hu: A statikus csomagok nagy méretűek és elavultak.

source: Because you're using package management, you will only ever download static libraries when there is no shared alternative. If you need new shared data libraries to install a given program, your package manager will know this and install them for you automatically. You will only ever have to download a shared library once because, well, it's shared by all the programs that need it. If you end up removing the last package that needs a shared library, then the package management software will remove that too. But, if you decide that you do want to keep the shared object anyway, perhaps because you just know you'll need it later, then you can tell the package management software to do that, too.
hu: Mivel csomagkezelőt használ, ezért statikus programkönyvtárakat csak akkor kell letöltenie, ha nincsenek elkészített közös programkönyvtárak. Ha a megadott program telepítéséhez új közös programkönyvtárak telepítése válik szükségessé, akkor a csomagkezelő ez tudni fogja, és automatikusan telepíti az érintett csomagokat. Önnek csak egyszer kell letöltenie a közös programkönyvtárakat, mert az összes azt használó program ugyanazokat a programkönyvtárakat fogja használni. Ha végezetül eltávolítja az összes – a közös programkönyvtárakat használó – programot, akkor a csomagkezelő program eltávolítja a már nem használt közös programkönyvtárakat is. Abban az esetben ha – például későbbi felhasználás céljából – meg kívánja tartani a közös programkönyvtárat utasíthatja a csomagkezelőt, hogy ne távolítsa el azt.

source: I'm still not convinced.
hu: Még mindig nem győzött meg.

source: Good! Post a message on the forums about it if you have a genuine concern about package management, or to ask about other people's experiences. It bears repeating that the package method of distribution in GNU/Linux relies on trust, so if there's a problem, we want to hear about it!
hu: Nagyszerű! Üzenjen a fórumunkba, ha Önnek eredeti kifogásai vannak a csomagkezeléssel kapcsolatban, vagy megismerné mások tapasztalatait. Érdemes megismételni, hogy a GNU/Linux disztribúcióban a csomagterjesztés alapja a bizalom, ha bármilyen problémát tapasztal, kérjük tudassa velünk!

source: A final word. You may have been subjected to rumors to the effect that Linux isn't finished yet, or that if you use Linux then you are a beta-tester, or that Linux software is unstable. These are all half truths. “Linux” will never be “finished”, any more than any other major operating system can be considered “finished”. From the Linux kernel to the artwork on your screen, all the elements of your operating system will always be under some kind of development. This is because programmers are working hard to keep us up to date with the latest developments in programming and hardware technology. This does not mean that the software available for you to use is of bad quality. The base system at the core of Linux Mint has been under heavy development for about two decades now, and is very mature, stable, and proven. While there are definitely unstable versions of most of the software on your operating system, you won't be using them because you're not a beta tester. You know you're not a beta tester, because you're reading this. The software available to you on the repositories you use will always be stable and well tested, unless you change those repositories to the ones used by the testers (in which case congratulations, you've just become a tester). It's a bit of a no-brainer, really.
hu: Végszó: Olyan pletykákat hallhat, amelyekben azt mondják, hogy a Linux még nem készült el, nincs befejezve. Vagy olyanokat, ahol azt mondják aki Linuxot használt az egy béta tesztelő. Esetleg azt állítják a Linux nem stabilt. Ezek féligazságok. A „Linux” soha nem lesz „befejezve”, ahogyan a többi operációs rendszerből sem adják ki a „végleg elkészült” változatot. A Linux rendszemagtól a képernyőn megjelenő grafikáig, minden összetevő az operációs rendszerben folyamatosan fejlődik. Ez azért van mert a programozók keményen dolgoznak azon, hogy friss megoldásokkal lássanak el minket és lépést tartsanak a programozásban és hardvertechnológiákban megjelenő újdonságokkal. Ez nem azt jelenti, hogy az Ön számára elérhető szoftver rossz minőségű. A Linux Mint magját képező alaprendszer több mint 20 év fejlesztés munkáját hordozza magában és nagyon kiforrott, stabil és megbízható. Miközben az Ön operációs rendszerén legtöbb szoftverből vannak kimondottan instabil kiadások, Ön nem ezeket használja, mert Ön nem béta tesztelő. Ön ha ezeket a sorokat olvassa, akkor tudhatja hogy nem béta tesztelő. Az Ön számára csomagtárolókon keresztül elérhetővé tett szoftverek mindig stabilak és alapos tesztelésnek vetettük őket alá, mindaddig, amíg nem állítja át rendszerét kiszolgáló csomagtárolókat a tesztelők által használt csomagtárolókra. Ha mégis ezt tenné, Ön tesztelővé válik.

source: So, to summarize with an example, when you install Opera, Real Player or Google Earth in Linux Mint, these applications do not come from their original developers (Opera, Real and Google). Of course the upstream application comes from these developers, but only after they've been properly packaged and tested do they become available for you. So, in other words, you should never need to go and browse the Internet to look for software, as everything you need is available and already tested for you and for your system by the Linux Mint and Ubuntu teams. All you need to do is choose what you want to do.
hu: Egy példán keresztül bemutatva: Amikor a Linux Mintben telepíti az Opera, a Real Player vagy a Google Earth programokat, ezek a programok nem közvetlenül az eredeti fejlesztőtől (Opera, Real, Google) érkeznek. Természetesen a fejlesztőktől érkeznek ezek a programok, de csak azután, hogy helyesen csomagolásra majd tesztelésre kerültek. Másképpen fogalmazva Önnek soha nem kell az internetet böngészve felkutatni a programokat, hanem minden, amire számítógépén szüksége van, elérhető és tesztelésre került a Linux Mint és az Ubuntu csapatai által.

source: Linux Mint will update itself automatically through a tool called the Update Manager, which will update not only the base operating system, but all the software installed on your machine as well.
hu: A Linux Mint automatikusan frissíti önmagát a Frissítéskezelő segítségével. Ez az eszköz csak az alap operációs rendszert frissíti, hanem az összes – számítógépére – telepített szoftvert is.

source: It's that simple. Whew!
hu: Ilyen egyszerű! Mit szól hozzá?

source: Installing software
hu: Szoftver telepítése

source: Some of the most popular applications that are not installed by default in Linux Mint are Opera, Skype, Acrobat Reader, Google Earth and Real Player.
hu: Néhány népszerű alkalmazás, amik alapértelmezetten nincsenek telepítve Linux Mintre: Opera, Skype, Acrobat Reader, Google Earth és Real Player.

source: Using the Software Manager
hu: A Szoftverkezelő használata

source: The easiest way to install software in Linux Mint is to use the <wordasword>Software Manager</wordasword>.
hu: A legegyszerűbben szoftvereket a <wordasword>Szoftverkezelő</wordasword> segítségével telepíthet a Linux Mint rendszerre.

source: The Software Manager
hu: A Szoftverkezelő

source: Open the <guimenu>Menu</guimenu> and select <guimenuitem>Software Manager</guimenuitem>.
hu: Nyissa meg a <guimenu>Menü</guimenu> gombra kattintva, majd válassza ki a <guimenuitem>Szoftverkezelő</guimenuitem> menüelemet.

source: The Software Manager lets you browse the software made available for Linux Mint. You can browse by category, search by keyword or sort the software by rating and popularity.
hu: A Szoftverkezelővel böngészheti a Linux Mintre elérhető szoftvereket kategóriák és kulcsszavak alapján. A szoftvereket sorba rendezheti értékelés és népszerűség szerint.

source: Using Synaptic
hu: Synaptic használata

source: If you want to install more than one application at a time or see more technical information about the packages, you can use <wordasword>Synaptic</wordasword>.
hu: Ha egyszerre több alkalmazást szeretne telepíteni, vagy több technikai információra kíváncsi a csomagokról, használja a <wordasword>Synaptic</wordasword> csomagkezelőt.

source: Synaptic, the Package Manager
hu: Synaptic csomagkezelő

source: Open the <guimenu>Menu</guimenu> and select <guimenuitem>Synaptic Package Manager</guimenuitem>.
hu: Nyissa meg a <guimenu>Menü</guimenu> gombra kattintva, majd válassza ki a <guimenuitem>Synaptic csomagkezelő</guimenuitem> menüelemet.

source: Let's see how we can install Opera (an alternative to the Firefox Web browser):
hu: Lássuk, hogyan telepíthető az Opera (a Firefox böngésző alternatívája) böngésző:

source: Click on the <guibutton>Search</guibutton> button and type <wordasword>opera</wordasword>.
hu: Kattintson a <guibutton>Keresés</guibutton> gombra és írja be: <wordasword>opera</wordasword>.

source: Go through the list of packages and find the one corresponding to the Opera Web Browser.
hu: Nézze meg a csomagok listáját és keresse meg az Opera böngésző csomagjait.

source: Tick the box and select <guimenuitem>Mark for Installation</guimenuitem>.
hu: Kattintson rá jobb gombbal és válassza a <guimenuitem>Kijelölés telepítésre</guimenuitem> menüpontot a helyi menüből.

source: Click on the <guibutton>Apply</guibutton> button.
hu: Kattintson a <guibutton>Alkalmaz</guibutton> gombra.

source: Using APT
hu: APT használata

source: APT is by far the most powerful package management tool in Linux Mint. Yet it's extremely simple to use.
hu: APT messze a leghatékonyabb csomagkezelő eszköz a Linux Mintben. Mégis rendkívül egyszerűen használható.

source: It's a command though, not a program with a graphical interface. If you're starting with Linux you'll probably prefer the Software Manager or Synaptic at first. As time goes on you'll likely enjoy things to be faster and more efficient.
hu: Ehhez a parancshoz nem tartozik grafikus felület. Ha kezdő Linuxban, akkor elsőre valószínűleg a Szoftverkezelőt vagy a Synaptic csomagkezelőt részesíti majd előnyben. Ahogy az idő telik, várhatóan egyre inkább élvezni fogja a gyorsabb és hatékonyabb dolgokat.

source: Now let's see how we could have installed Opera using the APT command line tool.
hu: Nézzük hogyan tudnánk telepíteni az Operát az APT parancssori eszközzel.

source: Open the <guimenu>Menu</guimenu> and select <guimenuitem>Terminal</guimenuitem>. Then type the following command:
hu: Nyissa meg a <guimenu>Menü</guimenu> gombra kattintva, majd válassza ki a <guimenuitem>Terminál</guimenuitem> menüelemet. Ezek után írja be a következő parancsot:

source: Make sure Synaptic is closed before using APT. Synaptic is using APT in the background so both can't run at the same time. The same goes for the Software Manager.
hu: Bizonyosodjon meg róla, hogy bezárta a Synaptic csomagkezelőtőt, mielőtt az APT-ot használja. A Synaptic a háttérben APT-ot használ, ezért e két program egyszerre nem futtatható. Ugyanez igaz a Szoftverkezelőre.

source: Removing software
hu: Szoftverek eltávolítása

source: You can use the Software Manager to remove software. Simply find the software you want to remove and click on <guibutton>Remove</guibutton>.
hu: Használhatja a Szoftverkezelőt szoftverek eltávolítására. Egyszerűen keresse meg a szoftvert, amit el akar távolítani és kattintson a <guibutton>Eltávolítás</guibuttion> gombra.

source: With Synaptic, you can remove packages by clicking on them and by selecting <guimenuitem>Mark for Removal</guimenuitem>. Changes are applied after you click on the <guibutton>Apply</guibutton> button.
hu: Synaptic-kal úgy távolíthat el csomagokat, hogy rájuk kattint és kiválasztja a <guimenuitem>Kijelölés eltávolításra</guimenuitem> menüpontot. A változtatások akkor lépnek érvénybe, amikor rákattint a <guibutton>Alkalmaz</guibutton> gombra.

source: With APT it's even simpler... say you want to remove Opera, open a <guimenuitem>Terminal</guimenuitem> from the <guimenu>Menu</guimenu> and type:
hu: APT-tal még ennél is egyszerűbb. Ha az Operát szeretné eltávolítani, válassza a <guimenuitem>Terminál</guimenuitem> menüpontot a <guimenu>Menü</guimenu>ben és gépelje be:

source: Updating software
hu: Szoftverek frissítése

source: If a new version of any package installed on your computer is made available you can upgrade to it. It may be a security update for some component of the operating system, it may be an optimization in one specific library or it may even be a newer version of Firefox. Basically, your system is made of packages and any part of it can be updated by updating some of those packages. This means replacing the current package with a newer version.
hu: Ha valamely telepített csomagnak új verziója jelenik meg, frissíteni tudja. Lehetséges, hogy az operációs rendszer valamely komponensének a biztonsági frissítésről van szó, az is lehet hogy egy programkönyvtárt optimalizáltak, esetleg a Firefoxnak megjelent az új verziója. Alapvetően a rendszer csomagokból áll és a rendszer bármely része frissíthető a hozzá tartozó csomagok frissítésével. Ilyenkor a jelenlegi csomagot lecseréljük egy új verzióval.

source: There are many ways to do this but only one of them is recommended.
hu: Ez sokféleképpen végrehajtható, de csak egy módon javasolt.

source: You could use APT to upgrade all your packages with one simple command (<command>apt upgrade</command>) but we recommend you don't do so. The reason is that it doesn't make any distinctions in selecting which updates to apply and assumes that you want all of them.
hu: Használhatja az APT-t, hogy egy egyszerű paranccsal (<command>apt upgrade</command>) az összes csomagot frissítse, de ezt a frissítési módot nem javasoljuk. Az említett parancs ugyanis feltételezi, hogy mindent frissíteni szeretne, nem tesz különbséget a különféle szoftverek frissítései között.

source: Some parts of the system are safe to update and some others aren't. For instance, by updating your kernel (the part which is responsible among other things for hardware recognition) you might break your sound support, your wireless card support or even some applications (such as VMWare and Virtualbox) which are closely linked to the kernel.
hu: A rendszer bizonyos részeit biztonságos frissíteni, más részeit nem. Például a kernelfrissítés (a kernel az a rész, ami többek közt a hardverek felismeréséért felelős), elronthatja a hangkezelés támogatást, a vezetéknélküli kártya támogatást vagy akár néhány alkalmazást (például a VMWare-t vagy Virtualboxot), melyek szorosan kapcsolódnak a kernelhez.

source: Linux Mint comes with a tool called the Update Manager. It gives more information about updates and lets you define how safe an update must be before you want to apply it. It looks like a shield and sits on the bottom-right corner of your screen.
hu: Linux Mint rendszer a Frissítéskezelővel van felszerelve. Ez a szoftver több információt ad arról, hogy a frissítések mennyire biztonságosak mielőtt feltelepítené. Ikonja egy pajzs és az értesítési panelen találja a jobb alsó sarokban.

source: If you place your mouse pointer on top of it, it will tell you either that your system is up to date or, if it isn't, how many updates are available.
hu: Ha az egérmutatót az ikon fölé viszi, akkor láthatja, hogy a rendszere naprakész, frissített állapotban van-e. Ha frissítésre van szükség, akkor mutatja, hogy mennyi frissítés érhető el.

source: The list of available updates
hu: Az elérhető frissítések listája

source: If you click on the lock icon, the Update Manager opens and shows you the updates that are available. The interface is very easy to use. For each package update you can read the description, the changelog (this is where developers explain their changes when they modify the package), and eventually if Linux Mint assigned warnings or extra information about the updates. You can also see which version is currently installed on your computer and which version is available for you to update to. Also you have a symbol showing if it's a package update or a security update.
hu: Ha a lakat ikonra kattint, a Frissítéskezelő ablak megjelenik és láthatja az elérhető frissítéseket. A felület nagyon egyszerűen használható. Minden csomagfrissítéshez tartozik egy leírás, a változások listája (ebben a fejlesztők leírják milyen módosítások történtek a csomagban) illetve a Linux Mint figyelmeztetéseket vagy egyéb információkat is rendel a frissítésekhez. Láthatja még a frissítendő csomagoknak a jelenleg telepített verzióját és az új verziót, amire frissíthet. Emellett egy szimbólum mutatja hogy egy egyszerű csomagfrissítésről vagy biztonsági frissítséről van-e szó.

source: Finally, you can see the stability level assigned to the package update. Each package update brings improvements or fixes security issues but that doesn't mean they're risk-free and can't introduce new bugs. The stability level is assigned to each package by Linux Mint and gives you an indication of how safe it is for you to apply an update.
hu: Végül minden csomagfrissítésnek láthatja a biztonsági szintjét. Minden frissítés újításokat hoz vagy hibákat javít ki, de ez nem jelenti azt hogy kockázatmentes a telepítésük és hogy nem hozhatnak be újabb hibákat. A csomagok biztonsági szintje jelzi, hogy az adott frissítés mennyire biztonságos.

source: Of course you can click on the columns to sort by stability level, status, package name or by version. You can select all updates or unselect all of them by using the <guibutton>Clear</guibutton> and <guibutton>Select All</guibutton> buttons.
hu: Rákattinthat az oszlopra, hogy sorba rendezzen megbízhatósági szint, állapot, csomagnév vagy verziószám alapján. Kiválaszthatja az összes frissítést a <guibutton>Összes kijelölése</guibutton> gombbal vagy törölheti a kiválasztást a <guibutton>Törlés</guibutton> gomb segítségével.

source: Level 1 and Level 2 updates are risk-free and you should always apply them. Level 3 updates should be safe but, although we recommend you take them, make sure you look over them on the list of updates. If you experience a problem with a particular Level 3 update, tell the Linux Mint development team so they can take measures to make that update a Level 4 or a Level 5 so as to warn or even discourage others against applying it.
hu: Az 1-es és 2-esz szintű frissítések kockázatmentesek, mindig érdemes telepíteni őket. A 3-as szintű frissítéseket ajánlott telepíteni, elvileg biztonságosak, mindenesetre érdemes átnézni ezeket a frissítési listában. Ha egy konkrét 3-as szintű frissítéssel problémába ütközne, értesítse a Linux Mint fejlesztői csapatát, így ők megnézik és ha szükséges, 4-es vagy 5-ös szintűnek minősítik, ezzel figyelmeztetve vagy akár ellenezve azt, hogy mások használják ezeket a frissítéseket.

source: The Update Manager preferences
hu: A Frissítéskezelő beállításai

source: If you click on the <guibutton>Preferences</guibutton> button you should see the screen above. By default the Update Manager tells you about Level 1, 2 and 3 updates. You can decide to make Level 4 and 5 <guilabel>visible</guilabel>. This will make more updates appear in the list. If you want to you can even make Level 4 and 5 updates <guilabel>safe</guilabel> (although this is not recommended). This will cause them to be selected by default within the Update Manager.
hu: Ha rákattint a <guibutton>Beállítások</guibutton> gombra, az alábbi képernyőt fogja látni. Alapértelmezésben a Frissítéskezelő az 1-es, 2-es és 3-as szintű frissítésekről tájékoztat. Dönthet úgy, hogy a 4-es és 5-ös szinteket is <guilabel>Látható</guilabel>vá teszi. Ha ezt beállítja, akkor a listában több frissítés fog megjelenni. Ha szeretné, akár beállíthatja a 4-es és 5-ös szintű frissítéseket <guilabel>biztonságos</guilabel>ra (habár ez nem javasolt). Ezzel alapértelmezésben kiválasztja őket a Frissítéskezelő.

source: The Update Manager only counts 'safe' updates. So when it tells you your system is up to date, it means there are no updates available assigned with a level that you defined as being 'safe'.
hu: A Frissítéskezelő csak a „biztonságos” frissítéseket számolja. Ha azt jelzi, hogy a rendszere naprakész, az azt jelenti, hogy azon a szinten, amit „biztonságosnak” jelölt meg, nincsenek frissítések.

source: The Update Manager only shows 'visible' updates in the list.
hu: A Frissítéskezelő csak a „látható” frissítéseket mutatja a listában.

source: For example, if you made all levels 'visible' and only Level 1 and 2 'safe', you would see a lot of updates in the list, but the Update Manager would probably tell you that your system was up to date.
hu: Például ha minden szintet „láthatóvá” tesz és csak az 1-es és 2-es szint „biztonságos”, sok frissítést fog látni a listában, de Frissítéskezelő azt fogja kiírni, hogy a rendszere naprakész.

source: The <guilabel>Auto-Refresh</guilabel> tab allows you to define how often the Update Manager checks for updates.
hu: Az <guilabel>Automatikus frissítés</guilabel> lapon beállíthatja, hogy a Frissítéskezelő milyen gyakran ellenőrizze a frissítéseket.

source: The <guilabel>Update Method</guilabel> tab lets you define how the Update Manager checks for new updates.
hu: A <guilabel>Frissítési mód</guilabel> lapon beállíthatja, hogy a Frissítéskezelő milyen módon ellenőrizze a frissítéseket.
